[
  {"id":"1", "minor":"3D Motion Design", "beschreibung":"Was in der Film-, Werbe- und Architekturbranche schon lange Standard ist, erreicht immer mehr auch Medienressorts von Grosskonzernen und KMU. Gemeint ist der Trend zum verbreiteten Einsatz von Erklär-, Web- oder Produktvideos, die mit Hilfe einer 3D Software umgesetzt werden. Immer öfters sind darum in Stellenausschreibungen Kenntnisse im 3D-Bereich gefordert, insbesondere bei In-House Medienabteilungen von Grosskonzernen und KMU, Agenturen oder Produktionshäusern.  In diesem Modul erlangen die Studierenden solide Kenntnisse im breiten Gebiet des 3D Motion Design. Sie durchlaufen alle relevanten Themengebiete, um sich selbst in der Welt der 3D-Animation kreativ ausleben zu können und erarbeiten dafür als Semesterprojekt einen eigenen, animierten Station. Nach erfolgreicher Kursteilnahme sind die Studierenden in der Lage, selbst ein eigenes 3D Motion Design Projekt zu planen und umzusetzen. Sie entwickeln ein Storyboard für einen fiktiven Station TVIdent und wenden das im Kurs erlernte Wissen für die praktische Umsetzung an. Schlussendlich kennen die Studierenden alle dafür nötigen Arbeitsschritte und wissen, wie sie ihr eigenes Projekt technisch und visuell umsetzen können. Das Endergebnis ist ein maximal 12 Sekunden langer TV-Ident."},
  {"id":"2", "minor":"Designing Multimedia Experiences", "beschreibung":"Dieses Minor ist die virtuelle Variante des Minors Eventinszenierung, mit etwas abgeänderten Inhalten. Heutzutage wird es immer anspruchsvoller, Besuchern von Brandlands, Restaurants, Events, Einkaufszentren oder Museen ein Erlebnis anzubieten, das beeindruckt. Dabei will man eine Botschaft oder ein Produkt mit Emotionen verbinden, oft mit dem Ziel, den Absatz zu fördern, Aufmerksamkeit zu generieren oder eine Marke stärker zu verankern.  Wichtige Werkzeuge zur Emotionalisierung von Besuchern sind Storytelling im Kontext mit den verschiedenen Inszenierungselementen, wie Geräuschen, Sounds, Farben, Duft, visuelle oder haptischen Reizen. In diesem Minor lernst Du bestehende inszenierte Welten und Atmosphären zu analysieren und zu verstehen, sowie ein neues Erlebnis-Konzepte zu erstellen aufgrund von Inputs aus verschiedenen Workshops mit Praxispartnern. Storytelling, das Du kennst, lernst Du im Raum mit verschiedenen medialen Gestaltungselementen einbetten und inszenieren. "},
  {"id":"3", "minor":"Eventinszenierung", "beschreibung":"Heutzutage wird es immer anspruchsvoller, Besuchern von Brandlands, Restaurants, Events, Einkaufszentren oder Museen ein Erlebnis anzubieten, das beeindruckt. Dabei will man eine Botschaft oder ein Produkt mit Emotionen verbinden, oft mit dem Ziel, den Absatz zu fördern, Aufmerksamkeit zu generieren oder eine Marke stärker zu verankern.  Wichtige Werkzeuge zur Emotionalisierung von Besuchern sind Storytelling im Kontext mit den verschiedenen Inszenierungselementen, wie Geräuschen, Sounds, Farben, Duft, visuelle oder haptischen Reizen. In diesem praxisnahen Minor lernst Du bestehende inszenierte Welten und Atmosphären zu analysieren und zu verstehen, sowie ein neues Erlebnis-Konzepte zu erstellen aufgrund von Inputs aus verschiedenen Workshops mit Praxispartnern. Storytelling, das Du kennst, lernst Du im Raum mit verschiedenen medialen Gestaltungselementen einbetten und inszenieren."},
  {"id":"4", "minor":"Looks Bildgestaltung", "beschreibung":"Cinematographische Looks mit digitalen Kameras sind angesagt. Was sind die Voraussetzungen für die Arbeit mit Looks und wie können diese generiert werden? Welchen Einfluss hat die Gestaltung mit Looks auf die Wirkung und Stimmung der Bilder? Welche Möglichkeiten bieten Bildprofile für die Erweiterung des Kontrastumfangs und wie kann dieser in der Postproduktion genutzt werden?   Diesen Fragen widmet sich der Minor «Looks». Die Studierenden erproben verschiedene Workflows mit professionellen Kamerasystemen. In mehreren Inputs werden technische Grundlagen vermittelt. Anhand von eigenen Aufnahmen und Filmbeispielen werden die Möglichkeiten der verschiedenen Arbeitsweisen diskutiert und deren Wirkung analysiert. In praxisnahen Übungen werden die verschiedenen Techniken angewendet. Die Studierenden realisieren im Rahmen des Moduls eine thematisch freie filmische Gruppenarbeit."},
  {"id":"5", "minor":"Audio für das 21. Jahrhundert", "beschreibung":"Video do not kill the Radiostar Der Begriff «Radio» kommt vom lateinischen «radius». Er bedeutet «strahlen». Daraus ergibt sich, dass Radio etwas ist, was strahlt, also sendet. So liegt das klassische Radioverständnis denn auch beim «Sender»: Eine Radiostation sendet ein Programm, auf der anderen Seite sind die Empfänger, die dieses Programm anhören, dann, wenn der Sender dieses sendet. Gespräche, Musik, Nachrichten – das, was eine Redaktion als «sendewürdig» definiert.  Heute legen wir den Radio-Begriff vielschichtiger aus und beschränken ihn nicht mehr auf «lineare Übertragung» (live). Daraus ergeben sich neue Möglichkeiten, Chancen und Herausforderungen. Radio ist nicht tot, wir müssen es nur neu erfinden.  Das tun wir! "},
  {"id":"6", "minor":"Corporate Social Media", "beschreibung":"#Influencer #NativeAdvertising #Virals #ContentMarketing #SocialAds #Shitstorm #InstagramStories #SEO #CommunityManagement #Analytics #Newsroom #... Social Media verändert unser Kommunikations- und Medienverhalten radikal. Auf einmal sind wir alle Reporter, Experten, Influencer, Botschafter, etc. Unternehmen und Organisationen stellt das vor ganz neue Herausforderungen. Einerseits sind da grosse Chancen wie der Dialog, die Daten, schnelle und direkte Kommunikation mit Konsumenten, neue Targetingmöglichkeiten und viel mehr. Auf der anderen Seite gibt es Shitstorms, Lesereporter, schlechte Reviews, Fake News, und und und. Unternehmen müssen ihre Kommunikation auf Social Media neu ausrichten. Wie gelingt das? Was sind überhaupt die neuen Chancen und wie kann man diese nutzen? Und wie geht man mit den Risiken um? Diese und mehr Fragen werden im Modul behandelt, diskutiert und bearbeitet. Das Modul wirft nicht nur einen Blick auf Social Media sondern stellt diese auch in einen grösseren Zusammenhang. Themen wie Content Marketing, SEO, Webmonitoring, digital Storytelling u.v.m. werden ebenso behandelt und diskutiert.  Das Modul vermittelt das notwendige Grundwissen, gemeinsam erarbeiten wir eine Toolbox für die Operation und in einer Projektarbeit wird das Erlernte und Geübte vertieft und in die Praxis umgesetzt."},
  {"id":"7", "minor":"Artificial Intelligence", "beschreibung":"Das Modul richtet sich an Studierende, die sich mit dem Thema KI vertraut machen möchten. Es bietet eine Einführung in zugängliche Technologien und Software und ermöglicht kreatives, praktisches Experimentieren mit verschiedenen KI-Werkzeugen. Es sind keine vorherigen technischen Kenntnisse oder Programmierkenntnisse erforderlich. Zudem wird die Bedeutung von KI für Design und Ingenieurwesen erforscht. Ein weiterer Schwerpunkt liegt auf der Entwicklung persönlicher Ideen und Konzepte im Bereich KI. Wir werden mit einfachen Skripten und vorgefertigten Vorlagen in den Programmiersprachen JavaScript und Python arbeiten. Die Vormittage sind den Einführungen und Übungen gewidmet. Nachmittags haben die Studierenden Zeit für praktische Experimente und werden individuell betreut.  Sprache: Englisch."},
  {"id":"8", "minor":"Creative Writing", "beschreibung":"Das Minor Creative Writing ist ein Wortspielraum, in dem du dich von alten Denkmustern lösen und die Kraft der Sprache neu entdecken kannst. Du öffnest deine Sinne und lässt dich von deinen Gedanken inspirieren. Dabei entdeckst du Welten zwischen den Zeilen, entwickelst schreibend neue Ideen und gedankliche Höhenflüge mit unerwartetem Tiefgang. Im Wechselspiel von begrifflich-analytischem und ganzheitlich-bildhaftem Denken entstehen Texte, die intensive Lesemomente schaffen. Denn sie zeigen deine Art, die Welt zu sehen, sind frei von Floskeln und geprägt von deinem ganz eigenen Schreibstil. Inspiration erhältst du aus zahlreichen intuitiven Schreibübungen, gemeinsamen Textanalysen, Theorieinputs sowie von einem Schriftsteller und/oder einer Spoken-Wort-Artistin. Nach diesem Minor hast du wertvolle Kompetenzen gewonnen, um den Anforderungen der agilen und schnelllebigen Berufswelt kreativ und innovativ zu begegnen."},
  {"id":"9", "minor":"Animation im Dokumentarfilm", "beschreibung":"Der Begriff Dokumentarfilm mag zunächst nicht die Vorstellung von animierten Bildwelten wecken. Vielmehr sind Realfilmszenen, Archivmaterial und Fotografien die Elemente, die maßgeblich seine Ästhetik bestimmen. Das Abbild der Realität stößt jedoch zuweilen an seine Grenzen. Aus diesem Grund machen sich dokumentarische Filmformate zuweilen die Bildsprache der Animation zunutze, um hybride Erfahrungsräume zu schaffen, die sich auf das beziehen, was vergangen ist, was nicht gezeigt werden kann oder auf emotionaler Ebene wirken soll. Das Modul führt an die Möglichkeiten heran, wie Animation für dokumentarische Inhalte eingesetzt werden kann. Wir werden gemeinsam von der Ideenfindung über die Konzeption bis hin zur Umsetzung eines kurzen Teasers für einen fiktiven Dokumentarfilm die Eigenheiten der Animationskunst erkunden und sein narratives Potenzial nutzen. Dabei gilt den Übergangen von Realfilm zu Animation eine besondere Aufmerksamkeit. Erfahrung im Bereich der Animation werden in diesem Modul vorausgesetzt."},
  {"id":"10", "minor":"Make it sound!", "beschreibung":"Multimedia ist nicht nur Bild, sondern oft auch Ton: Songs, Loops, Beats, Jingles, Geräuschkulissen und vieles mehr. Im Minor «Make It Sound» geht es um die Tonebene von Multimediaprodukten und die verschiedenen Aspekte und Funktionen von Filmton. Die Studierenden lernen den Prozess der Filmvertonung von A-Z kennen, mit allen Schritten von der Konzeption bis zur fertigen Produktion. Das Minor beinhaltet die ganzheitliche Vertonung von Multimediaprodukten durch Musik, Sounddesign und Dialoge. Von der Erstellung eines Soundkonzepts bis hin zur vollständigen Gestaltung eines Soundtracks werden die Studierenden in diesen Bereich eingeführt. Sie lernen den Umgang mit Musikproduktionstools, Audiobearbeitung und Sounddesigntechniken sowie Tonaufnahmen. Des Weiteren werden sie befähigt, eigene Musikstücke zu komponieren und zu produzieren. Das Mixing und Mastering von Audiomaterial wird ebenfalls behandelt. Im Hintergrundwissen werden Themen wie Instrumentenkunde, Musiktheorie und Ear Training abgedeckt, einschließlich virtueller Instrumente und Plugins. Als Tools werden Audition (vertiefend), GarageBand (Mac), Cubase oder Cakewalk (Windows, beide kostenlos verwendbar) oder eine eigene DAW (Digital Audio Workstation) mit MIDI-Funktion und Videospur verwendet. Es sind keine besonderen musikalischen Vorkenntnisse erforderlich, da die Studierenden mit ihren eigenen Fähigkeiten arbeiten. Oftmals können mit einfachen Mitteln bereits gute Ergebnisse erzielt werden. Zur Leistungsbewertung müssen die Studierenden 1 oder 2 Artefakte mit Sounddesign, Musik und möglicherweise Dialogen nach ihrem eigenen Konzept erstellen."},
  {"id":"11", "minor":"International and Intercultural Communication", "beschreibung":"Dieses Minor in Internationaler und interkultureller Kommunikation richtet sich an Studierende, die ihre Medien- und Kommunikationsarbeit erfolgreich mit Menschen aus anderen Kulturen durchführen möchten. Erfolgreiche internationale und interkulturelle Kommunikationsarbeit erfordert neue Herausforderungen und daher neue Fähigkeiten. Sie beginnt mit der Wahrnehmung der eigenen Kultur und des eigenen Denksystems. Daher werden wir in diesem Minor damit beginnen, das Bewusstsein für unsere eigene Kultur zu entwickeln. Wir werden auch die Unterschiede ausgewählter Kulturen studieren, um zu sehen, wie sie Identität, Denken, Wahrnehmung und alle Aspekte der Kommunikation, sei es von Angesicht zu Angesicht oder medial vermittelt, beeinflussen. Unser Ziel ist es, die Bedürfnisse unserer Zielgruppen besser zu verstehen, unsere Kommunikation über kulturelle Grenzen hinweg zu verbessern und die Fähigkeiten zu erwerben, angemessen in interkulturellen Situationen zu interagieren. Dieses Minor ist interaktiv und praktisch ausgerichtet. Die Lernergebnisse umfassen umfassendes Kulturverständnis und -wissen, kulturelle Selbstreflexion, kulturspezifische Informationen sowie soziolinguistisches Bewusstsein. Die erworbenen Fähigkeiten umfassen die Kompetenz, effektiv und angemessen in interkulturellen Situationen zu interagieren. Zudem werden die Fähigkeiten zur Verlagerung des Referenzsystems, zur Anpassungsfähigkeit, Flexibilität und Empathie sowie zur Relativierung der ethnozentrischen Sicht entwickelt. Sie werden ständig üben, Ihren Bezugspunkt auf andere Kulturen zu verlagern. Sie verlassen das Nebenfach mit der Fähigkeit, Ihre eigene Kultur und die Kultur anderer aus verschiedenen Perspektiven zu betrachten und einen flexibleren Denkansatz zu entwickeln, der Ihnen in Ihrer Karriere dienlich sein wird. Sprache: Englisch."},
  {"id":"12", "minor":"Werbespot und Imagefilm", "beschreibung":"Das Minor führt die Studierenden in die Welt der Werbung ein. Dabei erfahren sie die Eigenheiten dieses Genres, die Chancen und die Grenzen. Mein grösstes Anliegen dabei ist es, ihnen bewusst zu machen, wie wertvoll es ist, pointiert formulierte Botschaften mittels stimmiger Geschichten zu dramatisieren. Wir widmen uns neben der Ideenfindung auch den Themen Radiospot, TV-Spot und Imagefilm, den unterschiedlichen Erzählmitteln und -stilen und der Geschichte des Schweizer Werbefilms. Wobei es passend zur Theorie auch ganz viel Inspiration durch Beispiele gibt. Zudem konzipieren und produzieren die Studierenden in kleinen Teams je einen Radiospot und einen Werbespot. Nach erfolgreichem Abschluss des Moduls werden die Studierenden mit der Entwicklung audiovisueller Werbung in den letzten Jahrzehnten vertraut sein und ihre Einsatzmöglichkeiten kennen. Sie werden mit verschiedenen Erzählstilen vertraut sein und in der Lage sein, im Team einen Werbespot zu konzipieren und umzusetzen. Des Weiteren werden sie in der Lage sein, das Potenzial und die Grenzen von Radiospots zu erkennen und benennen zu können. Die Studierenden werden auch mit den gängigsten Erzählstilen in der Radiowerbung vertraut sein und die Hilfsmittel kennen, um die Aufmerksamkeit der Hörer zu wecken. Schließlich werden sie in der Lage sein, einen Radiospot zu konzipieren und zu produzieren."},
  {"id":"13", "minor":"New Independent Media", "beschreibung":"Die Welt der neuen unabhängigen Medien wächst und wächst. Wir unterhalten uns mit den coolsten davon wie www.tsüri.ch, www.republik.ch, www.bajour.ch, www.babanews.ch, www.maximumcinema.ch. Die Teams erzählen uns, wie sie ihre Start-ups gegründet hatten und erklären uns ihr Medienprodukt von allen Seiten. Dabei reden wir über den redaktionellen Betrieb, über CommunityAufbau und -Pflege, über Branding und auch darüber, wie man solche Projekte finanziert, etwa durch Crowdfunding-Kampagnen oder Stiftungsgelder. Professionelle Influencer erklären uns, was Medientitel von ihnen lernen können bezüglich Reichweite, Engagement und Werbe-Deals. Dein Leistungsnachweis ist ein Kurzreferat (allein oder als Team). Dabei schlagen dir unsere Partner im Kurs echte Beratungsthemen vor, du bekommst Vorschläge zu Branchenthemen von mir oder du bringst selbst dein Wunschthema ein (z.B. eigenes Medium gründen, etwas in Richtung kommende Bachelorarbeit «schnuppern»). Du erhältst Insider-Wissen, du wirst eng gecoacht, lernst viel und knüpfst hilfreiche Kontakte für dein weiteres Studium und Berufsleben."},
  {"id":"14", "minor":"Projektmanagement", "beschreibung":"Deine anstehende Berufskarriere wird geprägt sein von Projekten: Du leitest Projekte, du arbeitest in Projekten oder du gibst Projekte in Auftrag. Projektmanagement-Skills werden dir dabei dein Berufsleben und deine Karriere vereinfachen. Projektmanagement ist auch ein Begriff, den Arbeitgeber im CV sehen wollen. Theorie: so wenig wie möglich, so viel wie nötig. Im Minor bekommst du das Rüstzeug auf sehr praktische Weise. Wir schauen die Projektwelt 1:1 in hippen MMP-Agenturen, Kommunikationsabteilungen, Verlagen und Redaktionen an. Dabei triffst du auf bekannte Firmen Brands und knüpfst echte, hilfreiche Business-Kontakte. Wir sprechen beispielsweise über Planung, Organisation, Controlling, Qualität, Tools, Anforderungen und Ziele. Durch Soft Skills, die wir behandeln, lernen wir viel über Menschen, Menschen führen, Change Management, Konflikte und beispielsweise auch, wann und wie man geschäftlich «nein» sagt, um voranzukommen. Die Studierenden erhalten durch theoretische Grundlagen und praktische Anwendungen allgemeine Projektmanagement-Kompetenzen und -Fertigkeiten. Das Fach Projektmanagement behandelt anwendungsorientierte Fragestellungen von praktizierenden Multimedia-Ingenieuren und knüpft an betriebswirtschaftliche Fragestellungen an. Die Studierenden erhalten Einblick in die grundlegenden Aspekte von Projekten, wie Projektdefinition, Planung, Steuerung und Kontrolle. Sie lernen die Elemente, Gremien und Instrumente des Projektmanagements sowie die verschiedenen Rollen in Projektteams kennen. Des Weiteren werden sie mit den Herausforderungen des Projektmanagements vertraut gemacht und lernen gängige Projektmanagement-Konzepte kennen. Die Studierenden werden befähigt, eigenständig und ergebnisorientiert zu planen und umzusetzen und dabei die angemessenen Projektmanagement-Möglichkeiten zu wählen. Sie werden mit Fallbeispielen aus der Praxis vertraut gemacht und haben die Möglichkeit, ihre persönliche Arbeitstechnik zu optimieren."},
  {"id":"15", "minor":"Digital Marketing and Advertising", "beschreibung":"Wusstest Du, dass fast 30% der MMP-Absolventen nach dem Studium in Werbung und Marketing arbeiten? ..., dass die digitale Werbung - ob als Banner, als Post, als Video - weltweit der wichtigste Werbekanal ist und das lange dominierende Farbfernsehen hinter sich gelassen hat. Digitales Marketing und Advertising sind eine neue, spannende Industrie - mit unzähligen kreativen Möglichkeiten. Das Minor Digital Marketing vermittelt die Grundlagen von Online-Marketing und zeigt, wie man mit den neuen dominierenden Anbietern Google/Youtube, den Meta-Plattformen Facebook/Instagram sowie Tiktok geschickt umgehen kann. Es lehrt die neuen (oder nicht mehr ganz so neuen) Werbeformen wie Influencing, Content Marketing und natürlich die Datenanalyse, die Grundlage des Targeting ist. Dies alles nicht als trockene Theorie, sondern mit vielen praktischen Übungen und Anwendungen. Unterrichtet durch Profis aus Kreativ- und Mediaagenturen. Unsere Referenten sind: Kursleiter David Cappellini, Gründer der führenden Digital-Agentur Monami in Zürich, Berlin und Chur, seine rechte Hand Manuela Brunner, Spezialisten von Schweiz Touristmus und Swisscom, Silvia Princigalli vom Izzymag und andere Fachfrauen und Fachmänner."},
  {"id":"16", "minor":"Newsroom und investigativer Journalismus", "beschreibung":"Digital First, 24/7: die Digitalisierung des Journalismus und dessen Nutzung hat die Art und Weise fundamental verändert, wie heute für digitale Endgeräte (und allenfalls auch noch für etwas Gedrucktes) und Digital Natives produziert wird. Journalismus wird heute in Newsrooms hergestellt. Multimedial, als Flow, permanent updated, keinen Deadlines gehorchend. Text, Videos, Slide-Shows, DatenVisualisierungen - und über die Kommentar-Bereiche ständig in Interaktion mit dem Publikum. Weiterverbreitet über Social Media. So spannend, kreativ, aber auch anforderungsreich war der Journalismus noch nie. Auch wenn am Schluss schlicht noch immer die gute Story zählt. Neu ergänzen wir das Minor mit den Recherche-Techniken, die die Digitalisierung erlaubt: OSINT (kurz für Open Source Intelligence). Die in der digitalen Welt erhältlichen Texte, Fotos und Videos erlauben heute eine ganz andere, detektivische Recherche, vor der kein Potentat der Welt sicher ist. Auch Wladimir Putin nicht. Wie das alles funktioniert, welche Tools Ihr beherrschen müsst, zeigen Euch die Pioniere der Schweizer Newsrooms von Tamedia, Ringier, CH Media, Watson, NZZ, SRF und anderen Medienunternehmen. Natürlich nicht nur als Theorie, sondern in Workshops und Praxis-Übungen. Hauptreferent ist Peter Wälty, der das erfolgreichste News-Portal der Schweiz erfunden hat: 20 Minuten."},
  {"id":"17", "minor":"Postproduction", "beschreibung":"Das Minor «Postproduction» bietet in einen praxisorientierten Überblick über die wichtigsten Produktionsund Nachbearbeitungstechniken von digitalem Bildmaterial. Zwei Tage lang erlernen die Studenten / Studentinnen durch Tutorials den Umgang mit After Effects, Premiere und DaVinci Resolve. Gleichzeitig entwickeln sie ein eigenes Projekt, das sie in den restlichen 4 Tagen umsetzen. Wir setzen uns mit der Integration von Greenbox-Aufnahmen in mehrschichtigen Kompositionen auseinander, machen erste Erfahrungen mit Special Effects, erlernen neue Schnitt-Techniken und vertiefen unsere Kenntnisse im professionellen Umgang mit Ton und Farben. Ein zentraler Bestandteil des Moduls ist die Entwicklung eines eigenen Projekts, das die Studierenden mit fachkundiger Unterstützung umsetzen können. Nach erfolgreicher Teilnahme am Modul sind die Studierenden in der Lage, digitales Bewegtbildmaterial mit 3D-Compositing zu bearbeiten. Sie beherrschen den Einsatz professioneller Editing-Anwendungen für das erstellte Material und können die passende Postproduktionstechnik für jedes Projekt auswählen und umsetzen."},
  {"id":"18", "minor":"Minor XR Content Production", "beschreibung":"Minor XR Content Production In dieser Minor erlernen Sie das erstellen von Fotorealistischen 3D Modellen für die Verwendung in 3D Animationsfilmen, 3D Anwendungen wie Games oder auch Extended Reality. Auf Basis von (vielen) Fotografien von einem Objekt wird mittels dem Prozess der Fotogrammetrie ein 3D Modell rekonstruiert. Dieses Modell muss weiterarbeitet und vereinfacht werden, was z.Bsp. in Blender gemacht werden kann. Die Resultate können anschliessend in 3D-Animationen, 3DGames oder Extended Reality Anwendungen eingesetzt werden. Dieser Prozess wird in diversen Industrien eingesetzt um effizient hochqualitative 3D-Modelle zu erstellen. Nach erfolgreicher Teilnahme kennen die Studierenden die Grundlagen, Gemeinsamkeiten und Unterschiede von Virtual, Augmented und Mixed Reality. Sie sind mit verschiedenen Anwendungsbereichen und bewährten Praktiken vertraut. Darüber hinaus haben sie Kenntnisse über die gebräuchlichsten Geräte, die verschiedenen Verfolgungsmethoden und deren Grundprinzipien erlangt. Die Studierenden verstehen die Bedeutung von umfassenden Benutzertests. Des Weiteren sind die Studierenden nach Abschluss in der Lage, ihr Verständnis von UX/UI in einem xR-Konzept zu verbessern. Sie können eine zielorientierte Benutzerprüfung entwickeln und die Ergebnisse von Benutzertests in die Verbesserung eines Prototyps übertragen. Zusätzlich sind sie in der Lage, xR-Projekte hinsichtlich der User Experience und des User Interface zu bewerten."},
  {"id":"19", "minor":"Game Design and Interactive Storytelling", "beschreibung":"Der Schwerpunkt des Nebenfachs Game Design and Interactive Storytelling liegt darauf zu verstehen, wie die virtuelle Welt gestaltet werden kann, um den Körper und die Emotionen des Spielers/Nutzers zu beeinflussen. Die Techniken, die wir erforschen werden, sind nicht nur auf Videospiele anwendbar, sondern auf alle Designdisziplinen, die mit UX-Design (User-Experience) zu tun haben, wie z.B. Webdesign, VR usw. Das Format des Kurses besteht hauptsächlich aus Papier-Prototyping-Methoden, um das virtuelle Erlebnis des Nutzers durch Konzepte wie sensorisches Design, Spielmechanik, Storytelling, Weltgestaltung und Charakterdesign zu entwickeln und zu simulieren. Es sind keine Programmierkenntnisse erforderlich—nur ein Interesse an zeitlosen Kunst- und Designtechniken, die auf fortschrittliche interaktive Erfahrungen angewendet werden. Der Minor bietet auch einen Überblick über den Entwicklungs- und Iterationsprozess bei der Entwicklung von Videospielen sowie Überlegungen zur Präsentation des Projekts bei möglichen Investoren. Sprache: Englisch."},
  {"id":"20", "minor":"WebTech", "beschreibung":"Im Minor Webtech geht es, wie der Name schon vermuten lässt, um Webtechnologien. Welche Technologien wir uns anschauen entscheidet Ihr. Im Vorfeld des Minors treffen wir uns (physisch oder virtuell) und besprechen, welche Themen euch interessieren. Ihr wählt ein für euch neues Thema aus und arbeitet euch in dieses Thema ein. In den ersten beiden Minor-Blöcken schlüpft Ihr in die Dozierenden-Rolle und präsentiert euer Thema mit allen Vor- und Nachteilen sowie den Erfahrungen, die Ihr bei der Einarbeitungen gemacht habt. Ausserdem bereitet Ihr kleine Übungsaufgaben vor, die wir dann gemeinsam durchspielen. So bekommen wir alle einen guten Überblick über verschiedenste Webtechnologien. Der dritte Minor-Block ist der abschliessende Hackathon. Dort setzen wir uns zwei Tage an einem Ort ausserhalb von Chur, Bern oder Zürich zusammen um kleine, eigene Projekte umzusetzen. 30 Stunden Code.  die Studierenden den vertieften Umgang mit den gängigen Webtechnologien wie HTML, CSS, JavaScript, PHP, Datenbanken etc. Anhand von eigenen Projekten werden alle Aspekte der Webentwicklung detailliert geplant, umgesetzt und dokumentiert. Die Studierenden lernen den vertieften Umgang mit den gängigen Webtechnologien wie HTML, CSS, JavaScript, PHP, Datenbanken etc. Anhand von eigenen Projekten werden alle Aspekte der Webentwicklung detailliert geplant, umgesetzt und dokumentiert. Darüber hinaus werden sie in der Lage sein, ihr Projekt durch einen Vortrag zu präsentieren und ihre Arbeit effektiv zu kommunizieren."},
  {"id":"21", "minor":"WordPress DeepDive", "beschreibung":"In diesem Minor geht es um die detaillierte und vertiefte Beschäftigung mit Worpress. Mögliche Themen sind Themes, PlugIns, das Dashboard und Erweiterungen aller Art. Letztlich bestimmt ihr die Themen, denn wir werden euch schon im 4. Semester fragen, was euch an Wordpress interessiert. Diese Themen werden wir uns dann gemeinsam anschauen und ausprobieren.  Voraussetzung ist die Lust in die Tiefen von Wordpress hinabzutauchen und zu erforschen. Code wird sicher eine Rolle spielen, muss aber nicht im Vordergrund stehen. Ziel ist, dass ihr nach dem Minor nicht nur sicher im Umgang mit Wordpress seid, sondern auch wisst, wie eigene Erweiterung funktionieren und evtl. selbst solche Erweiterungen entwickeln könnt."},
  {"id":"22", "minor":"Zeichnen können ?", "beschreibung":"Der Kurs befasst sich mit den zahlreichen Möglichkeiten des Zeichnens. Geleitet und inspiriert von der künstlerischen Zeichnung, von der Henri Matisse einmal treffend behauptete L'éxactitude n'est pas la vérité, werden SuS ermuntert, ihre eigene zeichnerische Sprache zu entdecken und weiterzuentwickeln. Die persönliche Handschrift steht dabei ebenso im Zentrum wie die unterschiedlichsten zeichnerischen Konzepte, die kennenzulernen unumgänglich sind auf dem Weg zum individuellen Ausdruck.   Die künstlerische Zeichnung im 20. Jahrhundert scheint befreit vom akademischen Kanon der Renaissance. Möglichkeit ist Wirklichkeit, schreibt Robert Walser an einer Stelle. Wir suchen die Möglichkeiten und schauen, dass wir dabei nicht verloren gehen. Nach Absolvieren des Kurses sind SuS sensibilisiert auf die verschiedenen Ausdrucksformen der zeitgenössischen Zeichnung und verfügen über differenzierte Wahrnehmungskonzepte in der zeichnerischen Dokumentation unserer Umwelt. In der freien Arbeit durchlaufen SuS den Weg von der Idee bis zur zeichnerischen Realisation."},
  {"id":"23", "minor":"Learning from the professionals", "beschreibung":"Sie möchten herausfinden, wie die neuesten Innovationen in Architektur, Kunst und Multimedia entstehen? Sie möchten Kommunikationskonzepte identifizieren, analysieren und hinterfragen und sie in ihren sozialen Kontext stellen? Interdisziplinäre Teams bieten eine jährliche Studienreise in Kalenderwoche 35 (Sommerpause) zur Biennale in Venedig an. Diese weltweit führende Ausstellung für Architektur und Kunst dient als Inspiration für räumliche, architektonische, technische und gestalterische Visualisierungen. Insbesondere im Bereich 3D, VR, AR und künstliche Intelligenz können hier die besten und neuesten Installationen und Anwendungen betrachtet werden. Dieser kreativitätsfördernde Schub findet in der Kulisse der Stadt Venedig statt, die eine Verbindung von der Renaissance zu den neuesten Trends in der Ausstellungswelt herstellt. Die Studienreise führt die Studierenden speziell in die gezeigten Installationen und Anwendungen ein. Skizzen werden von diesen technischen Anwendungen erstellt, indem die Reverse-Engineering-Methode angewendet und visuell festgehalten wird. Das Skizzenbuch ist unser Werkzeug des Denkens, während gegenseitige Beobachtung und internationaler Austausch mit Diskussionen uns voranbringen. Das Skizzenbuch der Woche und eine individuelle Ausstellungsvisualisierung sind die Leistungen, um ECTS-Punkte zu erwerben. Voraussetzung: Für dieses Wahlfachmodul ist das Modul Sketch&Draw Voraussetzung."}

]
